const content = [
    {
        title: 'SPA',
        link: '/',
        description: 'SPA (Single Page Application) — это веб-приложение или веб-сайт, использующий единственный HTML-документ как оболочку для всех веб-страниц и организующий взаимодействие с пользователем через динамически подгружаемые HTML, CSS, JavaScript.'
    },
    {
        title: 'Проблема',
        link: '/problem',
        description: 'Поисковые роботы не умеют исполнять JavaScript-код, поэтому при посещении SPA-ресурса «из коробки», они получают пустой index.html и содержимое сайта не индексируется.'
    },
    {
        title: 'Задача',
        link: '/task',
        description: 'С минимальными изменениями в существующем проекте сделать так, чтобы поисковый робот индексировал все страницы SPA-приложения, а также установить для каждой страницы уникальные meta-теги (title, description, keywords ...etc).'
    },
    {
        title: 'Решение',
        link: '/solution',
        description: 'Пререндеринг проекта после сборки (проход по всем страницам SPA-приложения и создание их HTML копий).'
    },
    {
        title: 'Технологии',
        link: '/technologies'
    },
    {
        title: 'Результат',
        link: '/result',
        description: 'Ваше SPA полностью проиндексировано, сервер не справляется с наплывом посетителей.'
    },
    {
        title: 'Зачем',
        link: '/why',
        description: 'Проверить решение на практике, освежить в памяти React, JavaScript, БЭМ, роутинг, компонентный подход и вёрстку.'
    },
    {
        title: 'Кто',
        link: '/who'
    }
]

export default content;